Microchip-MPLAB-Harmony/csp/apps/flexcom/flexcom_spi_eeprom/firmware/src/packs/ATSAMA5D27_DFP/component/sdmmc.h
/* -------- SDMMC_PSR : (SDMMC Offset: 0x24) ( R/ 32) Present State Register -------- */
#define SDMMC_PSR_CMDINHC_Pos                 _U_(0)                                               /**< (SDMMC_PSR) Command Inhibit (CMD) Position */
#define SDMMC_PSR_CMDINHC_Msk                 (_U_(0x1) << SDMMC_PSR_CMDINHC_Pos)                  /**< (SDMMC_PSR) Command Inhibit (CMD) Mask */
#define SDMMC_PSR_CMDINHC(value)              (SDMMC_PSR_CMDINHC_Msk & ((value) << SDMMC_PSR_CMDINHC_Pos))
#define SDMMC_PSR_CMDINHD_Pos                 _U_(1)                                               /**< (SDMMC_PSR) Command Inhibit (DAT) Position */
#define SDMMC_PSR_CMDINHD_Msk                 (_U_(0x1) << SDMMC_PSR_CMDINHD_Pos)                  /**< (SDMMC_PSR) Command Inhibit (DAT) Mask */
#define SDMMC_PSR_CMDINHD(value)              (SDMMC_PSR_CMDINHD_Msk & ((value) << SDMMC_PSR_CMDINHD_Pos))
#define SDMMC_PSR_DLACT_Pos                   _U_(2)                                               /**< (SDMMC_PSR) DAT Line Active Position */
#define SDMMC_PSR_DLACT_Msk                   (_U_(0x1) << SDMMC_PSR_DLACT_Pos)                    /**< (SDMMC_PSR) DAT Line Active Mask */
#define SDMMC_PSR_DLACT(value)                (SDMMC_PSR_DLACT_Msk & ((value) << SDMMC_PSR_DLACT_Pos))
#define SDMMC_PSR_WTACT_Pos                   _U_(8)                                               /**< (SDMMC_PSR) Write Transfer Active Position */
#define SDMMC_PSR_WTACT_Msk                   (_U_(0x1) << SDMMC_PSR_WTACT_Pos)                    /**< (SDMMC_PSR) Write Transfer Active Mask */
#define SDMMC_PSR_WTACT(value)                (SDMMC_PSR_WTACT_Msk & ((value) << SDMMC_PSR_WTACT_Pos))
#define SDMMC_PSR_RTACT_Pos                   _U_(9)                                               /**< (SDMMC_PSR) Read Transfer Active Position */
#define SDMMC_PSR_RTACT_Msk                   (_U_(0x1) << SDMMC_PSR_RTACT_Pos)                    /**< (SDMMC_PSR) Read Transfer Active Mask */
#define SDMMC_PSR_RTACT(value)                (SDMMC_PSR_RTACT_Msk & ((value) << SDMMC_PSR_RTACT_Pos))
#define SDMMC_PSR_BUFWREN_Pos                 _U_(10)                                              /**< (SDMMC_PSR) Buffer Write Enable Position */
#define SDMMC_PSR_BUFWREN_Msk                 (_U_(0x1) << SDMMC_PSR_BUFWREN_Pos)                  /**< (SDMMC_PSR) Buffer Write Enable Mask */
#define SDMMC_PSR_BUFWREN(value)              (SDMMC_PSR_BUFWREN_Msk & ((value) << SDMMC_PSR_BUFWREN_Pos))
#define SDMMC_PSR_BUFRDEN_Pos                 _U_(11)                                              /**< (SDMMC_PSR) Buffer Read Enable Position */
#define SDMMC_PSR_BUFRDEN_Msk                 (_U_(0x1) << SDMMC_PSR_BUFRDEN_Pos)                  /**< (SDMMC_PSR) Buffer Read Enable Mask */
#define SDMMC_PSR_BUFRDEN(value)              (SDMMC_PSR_BUFRDEN_Msk & ((value) << SDMMC_PSR_BUFRDEN_Pos))
#define SDMMC_PSR_CARDINS_Pos                 _U_(16)                                              /**< (SDMMC_PSR) Card Inserted Position */
#define SDMMC_PSR_CARDINS_Msk                 (_U_(0x1) << SDMMC_PSR_CARDINS_Pos)                  /**< (SDMMC_PSR) Card Inserted Mask */
#define SDMMC_PSR_CARDINS(value)              (SDMMC_PSR_CARDINS_Msk & ((value) << SDMMC_PSR_CARDINS_Pos))
#define SDMMC_PSR_CARDSS_Pos                  _U_(17)                                              /**< (SDMMC_PSR) Card State Stable Position */
#define SDMMC_PSR_CARDSS_Msk                  (_U_(0x1) << SDMMC_PSR_CARDSS_Pos)                   /**< (SDMMC_PSR) Card State Stable Mask */
#define SDMMC_PSR_CARDSS(value)               (SDMMC_PSR_CARDSS_Msk & ((value) << SDMMC_PSR_CARDSS_Pos))
#define SDMMC_PSR_CARDDPL_Pos                 _U_(18)                                              /**< (SDMMC_PSR) Card Detect Pin Level Position */
#define SDMMC_PSR_CARDDPL_Msk                 (_U_(0x1) << SDMMC_PSR_CARDDPL_Pos)                  /**< (SDMMC_PSR) Card Detect Pin Level Mask */
#define SDMMC_PSR_CARDDPL(value)              (SDMMC_PSR_CARDDPL_Msk & ((value) << SDMMC_PSR_CARDDPL_Pos))
#define SDMMC_PSR_WRPPL_Pos                   _U_(19)                                              /**< (SDMMC_PSR) Write Protect Pin Level Position */
#define SDMMC_PSR_WRPPL_Msk                   (_U_(0x1) << SDMMC_PSR_WRPPL_Pos)                    /**< (SDMMC_PSR) Write Protect Pin Level Mask */
#define SDMMC_PSR_WRPPL(value)                (SDMMC_PSR_WRPPL_Msk & ((value) << SDMMC_PSR_WRPPL_Pos))
#define SDMMC_PSR_DATLL_Pos                   _U_(20)                                              /**< (SDMMC_PSR) DAT[3:0] Line Level Position */
#define SDMMC_PSR_DATLL_Msk                   (_U_(0xF) << SDMMC_PSR_DATLL_Pos)                    /**< (SDMMC_PSR) DAT[3:0] Line Level Mask */
#define SDMMC_PSR_DATLL(value)                (SDMMC_PSR_DATLL_Msk & ((value) << SDMMC_PSR_DATLL_Pos))
#define SDMMC_PSR_CMDLL_Pos                   _U_(24)                                              /**< (SDMMC_PSR) CMD Line Level Position */
#define SDMMC_PSR_CMDLL_Msk                   (_U_(0x1) << SDMMC_PSR_CMDLL_Pos)                    /**< (SDMMC_PSR) CMD Line Level Mask */
#define SDMMC_PSR_CMDLL(value)                (SDMMC_PSR_CMDLL_Msk & ((value) << SDMMC_PSR_CMDLL_Pos))
#define SDMMC_PSR_Msk                         _U_(0x01FF0F07)                                      /**< (SDMMC_PSR) Register Mask  */


/* -------- SDMMC_HC1R : (SDMMC Offset: 0x28) (R/W 8) Host Control 1 Register -------- */
#define SDMMC_HC1R_Msk                        _U_(0x00)                                            /**< (SDMMC_HC1R) Register Mask  */

/* SD_SDIO mode */
#define SDMMC_HC1R_SD_SDIO_LEDCTRL_Pos        _U_(0)                                               /**< (SDMMC_HC1R) LED Control Position */
#define SDMMC_HC1R_SD_SDIO_LEDCTRL_Msk        (_U_(0x1) << SDMMC_HC1R_SD_SDIO_LEDCTRL_Pos)         /**< (SDMMC_HC1R) LED Control Mask */
#define SDMMC_HC1R_SD_SDIO_LEDCTRL(value)     (SDMMC_HC1R_SD_SDIO_LEDCTRL_Msk & ((value) << SDMMC_HC1R_SD_SDIO_LEDCTRL_Pos))
#define   SDMMC_HC1R_SD_SDIO_LEDCTRL_OFF_Val  _U_(0x0)                                             /**< (SDMMC_HC1R) LED off.  */
#define   SDMMC_HC1R_SD_SDIO_LEDCTRL_ON_Val   _U_(0x1)                                             /**< (SDMMC_HC1R) LED on.  */
#define SDMMC_HC1R_SD_SDIO_LEDCTRL_OFF        (SDMMC_HC1R_SD_SDIO_LEDCTRL_OFF_Val << SDMMC_HC1R_SD_SDIO_LEDCTRL_Pos) /**< (SDMMC_HC1R) LED off. Position  */
#define SDMMC_HC1R_SD_SDIO_LEDCTRL_ON         (SDMMC_HC1R_SD_SDIO_LEDCTRL_ON_Val << SDMMC_HC1R_SD_SDIO_LEDCTRL_Pos) /**< (SDMMC_HC1R) LED on. Position  */
#define SDMMC_HC1R_SD_SDIO_DW_Pos             _U_(1)                                               /**< (SDMMC_HC1R) Data Width Position */
#define SDMMC_HC1R_SD_SDIO_DW_Msk             (_U_(0x1) << SDMMC_HC1R_SD_SDIO_DW_Pos)              /**< (SDMMC_HC1R) Data Width Mask */
#define SDMMC_HC1R_SD_SDIO_DW(value)          (SDMMC_HC1R_SD_SDIO_DW_Msk & ((value) << SDMMC_HC1R_SD_SDIO_DW_Pos))
#define   SDMMC_HC1R_SD_SDIO_DW_1_BIT_Val     _U_(0x0)                                             /**< (SDMMC_HC1R) 1-bit mode.  */
#define   SDMMC_HC1R_SD_SDIO_DW_4_BIT_Val     _U_(0x1)                                             /**< (SDMMC_HC1R) 4-bit mode.  */
#define SDMMC_HC1R_SD_SDIO_DW_1_BIT           (SDMMC_HC1R_SD_SDIO_DW_1_BIT_Val << SDMMC_HC1R_SD_SDIO_DW_Pos) /**< (SDMMC_HC1R) 1-bit mode. Position  */
#define SDMMC_HC1R_SD_SDIO_DW_4_BIT           (SDMMC_HC1R_SD_SDIO_DW_4_BIT_Val << SDMMC_HC1R_SD_SDIO_DW_Pos) /**< (SDMMC_HC1R) 4-bit mode. Position  */
#define SDMMC_HC1R_SD_SDIO_HSEN_Pos           _U_(2)                                               /**< (SDMMC_HC1R) High Speed Enable Position */
#define SDMMC_HC1R_SD_SDIO_HSEN_Msk           (_U_(0x1) << SDMMC_HC1R_SD_SDIO_HSEN_Pos)            /**< (SDMMC_HC1R) High Speed Enable Mask */
#define SDMMC_HC1R_SD_SDIO_HSEN(value)        (SDMMC_HC1R_SD_SDIO_HSEN_Msk & ((value) << SDMMC_HC1R_SD_SDIO_HSEN_Pos))
#define SDMMC_HC1R_SD_SDIO_DMASEL_Pos         _U_(3)                                               /**< (SDMMC_HC1R) DMA Select Position */
#define SDMMC_HC1R_SD_SDIO_DMASEL_Msk         (_U_(0x3) << SDMMC_HC1R_SD_SDIO_DMASEL_Pos)          /**< (SDMMC_HC1R) DMA Select Mask */
#define SDMMC_HC1R_SD_SDIO_DMASEL(value)      (SDMMC_HC1R_SD_SDIO_DMASEL_Msk & ((value) << SDMMC_HC1R_SD_SDIO_DMASEL_Pos))
#define   SDMMC_HC1R_SD_SDIO_DMASEL_SDMA_Val  _U_(0x0)                                             /**< (SDMMC_HC1R) SDMA is selected  */
#define   SDMMC_HC1R_SD_SDIO_DMASEL_ADMA32_Val _U_(0x2)                                             /**< (SDMMC_HC1R) 32-bit Address ADMA2 is selected  */
#define SDMMC_HC1R_SD_SDIO_DMASEL_SDMA        (SDMMC_HC1R_SD_SDIO_DMASEL_SDMA_Val << SDMMC_HC1R_SD_SDIO_DMASEL_Pos) /**< (SDMMC_HC1R) SDMA is selected Position  */
#define SDMMC_HC1R_SD_SDIO_DMASEL_ADMA32      (SDMMC_HC1R_SD_SDIO_DMASEL_ADMA32_Val << SDMMC_HC1R_SD_SDIO_DMASEL_Pos) /**< (SDMMC_HC1R) 32-bit Address ADMA2 is selected Position  */
#define SDMMC_HC1R_SD_SDIO_CARDDTL_Pos        _U_(6)                                               /**< (SDMMC_HC1R) Card Detect Test Level Position */
#define SDMMC_HC1R_SD_SDIO_CARDDTL_Msk        (_U_(0x1) << SDMMC_HC1R_SD_SDIO_CARDDTL_Pos)         /**< (SDMMC_HC1R) Card Detect Test Level Mask */
#define SDMMC_HC1R_SD_SDIO_CARDDTL(value)     (SDMMC_HC1R_SD_SDIO_CARDDTL_Msk & ((value) << SDMMC_HC1R_SD_SDIO_CARDDTL_Pos))
#define SDMMC_HC1R_SD_SDIO_CARDDSEL_Pos       _U_(7)                                               /**< (SDMMC_HC1R) Card Detect Signal Selection Position */
#define SDMMC_HC1R_SD_SDIO_CARDDSEL_Msk       (_U_(0x1) << SDMMC_HC1R_SD_SDIO_CARDDSEL_Pos)        /**< (SDMMC_HC1R) Card Detect Signal Selection Mask */
#define SDMMC_HC1R_SD_SDIO_CARDDSEL(value)    (SDMMC_HC1R_SD_SDIO_CARDDSEL_Msk & ((value) << SDMMC_HC1R_SD_SDIO_CARDDSEL_Pos))
#define SDMMC_HC1R_SD_SDIO_Msk                _U_(0xDF)                                             /**< (SDMMC_HC1R_SD_SDIO) Register Mask  */

