Microchip-MPLAB-Harmony/csp/apps/flexcom/flexcom_spi_eeprom/firmware/src/packs/ATSAMA5D27_DFP/component/sdmmc.h
/* -------- SDMMC_TCR : (SDMMC Offset: 0x2E) (R/W 8) Timeout Control Register -------- */
#define SDMMC_TCR_DTCVAL_Pos                  _U_(0)                                               /**< (SDMMC_TCR) Data Timeout Counter Value Position */
#define SDMMC_TCR_DTCVAL_Msk                  (_U_(0xF) << SDMMC_TCR_DTCVAL_Pos)                   /**< (SDMMC_TCR) Data Timeout Counter Value Mask */
#define SDMMC_TCR_DTCVAL(value)               (SDMMC_TCR_DTCVAL_Msk & ((value) << SDMMC_TCR_DTCVAL_Pos))
#define SDMMC_TCR_Msk                         _U_(0x0F)                                            /**< (SDMMC_TCR) Register Mask  */


/* -------- SDMMC_SRR : (SDMMC Offset: 0x2F) (R/W 8) Software Reset Register -------- */
#define SDMMC_SRR_SWRSTALL_Pos                _U_(0)                                               /**< (SDMMC_SRR) Software reset for All Position */
#define SDMMC_SRR_SWRSTALL_Msk                (_U_(0x1) << SDMMC_SRR_SWRSTALL_Pos)                 /**< (SDMMC_SRR) Software reset for All Mask */
#define SDMMC_SRR_SWRSTALL(value)             (SDMMC_SRR_SWRSTALL_Msk & ((value) << SDMMC_SRR_SWRSTALL_Pos))
#define SDMMC_SRR_SWRSTCMD_Pos                _U_(1)                                               /**< (SDMMC_SRR) Software reset for CMD line Position */
#define SDMMC_SRR_SWRSTCMD_Msk                (_U_(0x1) << SDMMC_SRR_SWRSTCMD_Pos)                 /**< (SDMMC_SRR) Software reset for CMD line Mask */
#define SDMMC_SRR_SWRSTCMD(value)             (SDMMC_SRR_SWRSTCMD_Msk & ((value) << SDMMC_SRR_SWRSTCMD_Pos))
#define SDMMC_SRR_SWRSTDAT_Pos                _U_(2)                                               /**< (SDMMC_SRR) Software reset for DAT line Position */
#define SDMMC_SRR_SWRSTDAT_Msk                (_U_(0x1) << SDMMC_SRR_SWRSTDAT_Pos)                 /**< (SDMMC_SRR) Software reset for DAT line Mask */
#define SDMMC_SRR_SWRSTDAT(value)             (SDMMC_SRR_SWRSTDAT_Msk & ((value) << SDMMC_SRR_SWRSTDAT_Pos))
#define SDMMC_SRR_Msk                         _U_(0x07)                                            /**< (SDMMC_SRR) Register Mask  */


/* -------- SDMMC_NISTR : (SDMMC Offset: 0x30) (R/W 16) Normal Interrupt Status Register -------- */
#define SDMMC_NISTR_Msk                       _U_(0x0000)                                          /**< (SDMMC_NISTR) Register Mask  */

/* SD_SDIO mode */
#define SDMMC_NISTR_SD_SDIO_CMDC_Pos          _U_(0)                                               /**< (SDMMC_NISTR) Command Complete Position */
#define SDMMC_NISTR_SD_SDIO_CMDC_Msk          (_U_(0x1) << SDMMC_NISTR_SD_SDIO_CMDC_Pos)           /**< (SDMMC_NISTR) Command Complete Mask */
#define SDMMC_NISTR_SD_SDIO_CMDC(value)       (SDMMC_NISTR_SD_SDIO_CMDC_Msk & ((value) << SDMMC_NISTR_SD_SDIO_CMDC_Pos))
#define SDMMC_NISTR_SD_SDIO_TRFC_Pos          _U_(1)                                               /**< (SDMMC_NISTR) Transfer Complete Position */
#define SDMMC_NISTR_SD_SDIO_TRFC_Msk          (_U_(0x1) << SDMMC_NISTR_SD_SDIO_TRFC_Pos)           /**< (SDMMC_NISTR) Transfer Complete Mask */
#define SDMMC_NISTR_SD_SDIO_TRFC(value)       (SDMMC_NISTR_SD_SDIO_TRFC_Msk & ((value) << SDMMC_NISTR_SD_SDIO_TRFC_Pos))
#define SDMMC_NISTR_SD_SDIO_BLKGE_Pos         _U_(2)                                               /**< (SDMMC_NISTR) Block Gap Event Position */
#define SDMMC_NISTR_SD_SDIO_BLKGE_Msk         (_U_(0x1) << SDMMC_NISTR_SD_SDIO_BLKGE_Pos)          /**< (SDMMC_NISTR) Block Gap Event Mask */
#define SDMMC_NISTR_SD_SDIO_BLKGE(value)      (SDMMC_NISTR_SD_SDIO_BLKGE_Msk & ((value) << SDMMC_NISTR_SD_SDIO_BLKGE_Pos))
#define SDMMC_NISTR_SD_SDIO_DMAINT_Pos        _U_(3)                                               /**< (SDMMC_NISTR) DMA Interrupt Position */
#define SDMMC_NISTR_SD_SDIO_DMAINT_Msk        (_U_(0x1) << SDMMC_NISTR_SD_SDIO_DMAINT_Pos)         /**< (SDMMC_NISTR) DMA Interrupt Mask */
#define SDMMC_NISTR_SD_SDIO_DMAINT(value)     (SDMMC_NISTR_SD_SDIO_DMAINT_Msk & ((value) << SDMMC_NISTR_SD_SDIO_DMAINT_Pos))
#define SDMMC_NISTR_SD_SDIO_BWRRDY_Pos        _U_(4)                                               /**< (SDMMC_NISTR) Buffer Write Ready Position */
#define SDMMC_NISTR_SD_SDIO_BWRRDY_Msk        (_U_(0x1) << SDMMC_NISTR_SD_SDIO_BWRRDY_Pos)         /**< (SDMMC_NISTR) Buffer Write Ready Mask */
#define SDMMC_NISTR_SD_SDIO_BWRRDY(value)     (SDMMC_NISTR_SD_SDIO_BWRRDY_Msk & ((value) << SDMMC_NISTR_SD_SDIO_BWRRDY_Pos))
#define SDMMC_NISTR_SD_SDIO_BRDRDY_Pos        _U_(5)                                               /**< (SDMMC_NISTR) Buffer Read Ready Position */
#define SDMMC_NISTR_SD_SDIO_BRDRDY_Msk        (_U_(0x1) << SDMMC_NISTR_SD_SDIO_BRDRDY_Pos)         /**< (SDMMC_NISTR) Buffer Read Ready Mask */
#define SDMMC_NISTR_SD_SDIO_BRDRDY(value)     (SDMMC_NISTR_SD_SDIO_BRDRDY_Msk & ((value) << SDMMC_NISTR_SD_SDIO_BRDRDY_Pos))
#define SDMMC_NISTR_SD_SDIO_CINS_Pos          _U_(6)                                               /**< (SDMMC_NISTR) Card Insertion Position */
#define SDMMC_NISTR_SD_SDIO_CINS_Msk          (_U_(0x1) << SDMMC_NISTR_SD_SDIO_CINS_Pos)           /**< (SDMMC_NISTR) Card Insertion Mask */
#define SDMMC_NISTR_SD_SDIO_CINS(value)       (SDMMC_NISTR_SD_SDIO_CINS_Msk & ((value) << SDMMC_NISTR_SD_SDIO_CINS_Pos))
#define SDMMC_NISTR_SD_SDIO_CREM_Pos          _U_(7)                                               /**< (SDMMC_NISTR) Card Removal Position */
#define SDMMC_NISTR_SD_SDIO_CREM_Msk          (_U_(0x1) << SDMMC_NISTR_SD_SDIO_CREM_Pos)           /**< (SDMMC_NISTR) Card Removal Mask */
#define SDMMC_NISTR_SD_SDIO_CREM(value)       (SDMMC_NISTR_SD_SDIO_CREM_Msk & ((value) << SDMMC_NISTR_SD_SDIO_CREM_Pos))
#define SDMMC_NISTR_SD_SDIO_CINT_Pos          _U_(8)                                               /**< (SDMMC_NISTR) Card Interrupt Position */
#define SDMMC_NISTR_SD_SDIO_CINT_Msk          (_U_(0x1) << SDMMC_NISTR_SD_SDIO_CINT_Pos)           /**< (SDMMC_NISTR) Card Interrupt Mask */
#define SDMMC_NISTR_SD_SDIO_CINT(value)       (SDMMC_NISTR_SD_SDIO_CINT_Msk & ((value) << SDMMC_NISTR_SD_SDIO_CINT_Pos))
#define SDMMC_NISTR_SD_SDIO_ERRINT_Pos        _U_(15)                                              /**< (SDMMC_NISTR) Error Interrupt Position */
#define SDMMC_NISTR_SD_SDIO_ERRINT_Msk        (_U_(0x1) << SDMMC_NISTR_SD_SDIO_ERRINT_Pos)         /**< (SDMMC_NISTR) Error Interrupt Mask */
#define SDMMC_NISTR_SD_SDIO_ERRINT(value)     (SDMMC_NISTR_SD_SDIO_ERRINT_Msk & ((value) << SDMMC_NISTR_SD_SDIO_ERRINT_Pos))
#define SDMMC_NISTR_SD_SDIO_Msk               _U_(0x81FF)                                           /**< (SDMMC_NISTR_SD_SDIO) Register Mask  */

