Microchip-MPLAB-Harmony/csp/apps/flexcom/flexcom_spi_eeprom/firmware/src/packs/ATSAMA5D27_DFP/component/sdmmc.h
/* E_MMC mode */
#define SDMMC_EISTR_E_MMC_CMDTEO_Pos          _U_(0)                                               /**< (SDMMC_EISTR) Command Timeout Error Position */
#define SDMMC_EISTR_E_MMC_CMDTEO_Msk          (_U_(0x1) << SDMMC_EISTR_E_MMC_CMDTEO_Pos)           /**< (SDMMC_EISTR) Command Timeout Error Mask */
#define SDMMC_EISTR_E_MMC_CMDTEO(value)       (SDMMC_EISTR_E_MMC_CMDTEO_Msk & ((value) << SDMMC_EISTR_E_MMC_CMDTEO_Pos))
#define SDMMC_EISTR_E_MMC_CMDCRC_Pos          _U_(1)                                               /**< (SDMMC_EISTR) Command CRC Error Position */
#define SDMMC_EISTR_E_MMC_CMDCRC_Msk          (_U_(0x1) << SDMMC_EISTR_E_MMC_CMDCRC_Pos)           /**< (SDMMC_EISTR) Command CRC Error Mask */
#define SDMMC_EISTR_E_MMC_CMDCRC(value)       (SDMMC_EISTR_E_MMC_CMDCRC_Msk & ((value) << SDMMC_EISTR_E_MMC_CMDCRC_Pos))
#define SDMMC_EISTR_E_MMC_CMDEND_Pos          _U_(2)                                               /**< (SDMMC_EISTR) Command End Bit Error Position */
#define SDMMC_EISTR_E_MMC_CMDEND_Msk          (_U_(0x1) << SDMMC_EISTR_E_MMC_CMDEND_Pos)           /**< (SDMMC_EISTR) Command End Bit Error Mask */
#define SDMMC_EISTR_E_MMC_CMDEND(value)       (SDMMC_EISTR_E_MMC_CMDEND_Msk & ((value) << SDMMC_EISTR_E_MMC_CMDEND_Pos))
#define SDMMC_EISTR_E_MMC_CMDIDX_Pos          _U_(3)                                               /**< (SDMMC_EISTR) Command Index Error Position */
#define SDMMC_EISTR_E_MMC_CMDIDX_Msk          (_U_(0x1) << SDMMC_EISTR_E_MMC_CMDIDX_Pos)           /**< (SDMMC_EISTR) Command Index Error Mask */
#define SDMMC_EISTR_E_MMC_CMDIDX(value)       (SDMMC_EISTR_E_MMC_CMDIDX_Msk & ((value) << SDMMC_EISTR_E_MMC_CMDIDX_Pos))
#define SDMMC_EISTR_E_MMC_DATTEO_Pos          _U_(4)                                               /**< (SDMMC_EISTR) Data Timeout error Position */
#define SDMMC_EISTR_E_MMC_DATTEO_Msk          (_U_(0x1) << SDMMC_EISTR_E_MMC_DATTEO_Pos)           /**< (SDMMC_EISTR) Data Timeout error Mask */
#define SDMMC_EISTR_E_MMC_DATTEO(value)       (SDMMC_EISTR_E_MMC_DATTEO_Msk & ((value) << SDMMC_EISTR_E_MMC_DATTEO_Pos))
#define SDMMC_EISTR_E_MMC_DATCRC_Pos          _U_(5)                                               /**< (SDMMC_EISTR) Data CRC Error Position */
#define SDMMC_EISTR_E_MMC_DATCRC_Msk          (_U_(0x1) << SDMMC_EISTR_E_MMC_DATCRC_Pos)           /**< (SDMMC_EISTR) Data CRC Error Mask */
#define SDMMC_EISTR_E_MMC_DATCRC(value)       (SDMMC_EISTR_E_MMC_DATCRC_Msk & ((value) << SDMMC_EISTR_E_MMC_DATCRC_Pos))
#define SDMMC_EISTR_E_MMC_DATEND_Pos          _U_(6)                                               /**< (SDMMC_EISTR) Data End Bit Error Position */
#define SDMMC_EISTR_E_MMC_DATEND_Msk          (_U_(0x1) << SDMMC_EISTR_E_MMC_DATEND_Pos)           /**< (SDMMC_EISTR) Data End Bit Error Mask */
#define SDMMC_EISTR_E_MMC_DATEND(value)       (SDMMC_EISTR_E_MMC_DATEND_Msk & ((value) << SDMMC_EISTR_E_MMC_DATEND_Pos))
#define SDMMC_EISTR_E_MMC_CURLIM_Pos          _U_(7)                                               /**< (SDMMC_EISTR) Current Limit Error Position */
#define SDMMC_EISTR_E_MMC_CURLIM_Msk          (_U_(0x1) << SDMMC_EISTR_E_MMC_CURLIM_Pos)           /**< (SDMMC_EISTR) Current Limit Error Mask */
#define SDMMC_EISTR_E_MMC_CURLIM(value)       (SDMMC_EISTR_E_MMC_CURLIM_Msk & ((value) << SDMMC_EISTR_E_MMC_CURLIM_Pos))
#define SDMMC_EISTR_E_MMC_ACMD_Pos            _U_(8)                                               /**< (SDMMC_EISTR) Auto CMD Error Position */
#define SDMMC_EISTR_E_MMC_ACMD_Msk            (_U_(0x1) << SDMMC_EISTR_E_MMC_ACMD_Pos)             /**< (SDMMC_EISTR) Auto CMD Error Mask */
#define SDMMC_EISTR_E_MMC_ACMD(value)         (SDMMC_EISTR_E_MMC_ACMD_Msk & ((value) << SDMMC_EISTR_E_MMC_ACMD_Pos))
#define SDMMC_EISTR_E_MMC_ADMA_Pos            _U_(9)                                               /**< (SDMMC_EISTR) ADMA Error Position */
#define SDMMC_EISTR_E_MMC_ADMA_Msk            (_U_(0x1) << SDMMC_EISTR_E_MMC_ADMA_Pos)             /**< (SDMMC_EISTR) ADMA Error Mask */
#define SDMMC_EISTR_E_MMC_ADMA(value)         (SDMMC_EISTR_E_MMC_ADMA_Msk & ((value) << SDMMC_EISTR_E_MMC_ADMA_Pos))
#define SDMMC_EISTR_E_MMC_BOOTAE_Pos          _U_(12)                                              /**< (SDMMC_EISTR) Boot Acknowledge Error Position */
#define SDMMC_EISTR_E_MMC_BOOTAE_Msk          (_U_(0x1) << SDMMC_EISTR_E_MMC_BOOTAE_Pos)           /**< (SDMMC_EISTR) Boot Acknowledge Error Mask */
#define SDMMC_EISTR_E_MMC_BOOTAE(value)       (SDMMC_EISTR_E_MMC_BOOTAE_Msk & ((value) << SDMMC_EISTR_E_MMC_BOOTAE_Pos))
#define SDMMC_EISTR_E_MMC_Msk                 _U_(0x13FF)                                           /**< (SDMMC_EISTR_E_MMC) Register Mask  */


/* -------- SDMMC_NISTER : (SDMMC Offset: 0x34) (R/W 16) Normal Interrupt Status Enable Register -------- */
#define SDMMC_NISTER_Msk                      _U_(0x0000)                                          /**< (SDMMC_NISTER) Register Mask  */

/* SD_SDIO mode */
#define SDMMC_NISTER_SD_SDIO_CMDC_Pos         _U_(0)                                               /**< (SDMMC_NISTER) Command Complete Status Enable Position */
#define SDMMC_NISTER_SD_SDIO_CMDC_Msk         (_U_(0x1) << SDMMC_NISTER_SD_SDIO_CMDC_Pos)          /**< (SDMMC_NISTER) Command Complete Status Enable Mask */
#define SDMMC_NISTER_SD_SDIO_CMDC(value)      (SDMMC_NISTER_SD_SDIO_CMDC_Msk & ((value) << SDMMC_NISTER_SD_SDIO_CMDC_Pos))
#define   SDMMC_NISTER_SD_SDIO_CMDC_MASKED_Val _U_(0x0)                                             /**< (SDMMC_NISTER) The CMDC status flag in SDMMC_NISTR is masked.  */
#define   SDMMC_NISTER_SD_SDIO_CMDC_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_NISTER) The CMDC status flag in SDMMC_NISTR is enabled.  */
#define SDMMC_NISTER_SD_SDIO_CMDC_MASKED      (SDMMC_NISTER_SD_SDIO_CMDC_MASKED_Val << SDMMC_NISTER_SD_SDIO_CMDC_Pos) /**< (SDMMC_NISTER) The CMDC status flag in SDMMC_NISTR is masked. Position  */
#define SDMMC_NISTER_SD_SDIO_CMDC_ENABLED     (SDMMC_NISTER_SD_SDIO_CMDC_ENABLED_Val << SDMMC_NISTER_SD_SDIO_CMDC_Pos) /**< (SDMMC_NISTER) The CMDC status flag in SDMMC_NISTR is enabled. Position  */
#define SDMMC_NISTER_SD_SDIO_TRFC_Pos         _U_(1)                                               /**< (SDMMC_NISTER) Transfer Complete Status Enable Position */
#define SDMMC_NISTER_SD_SDIO_TRFC_Msk         (_U_(0x1) << SDMMC_NISTER_SD_SDIO_TRFC_Pos)          /**< (SDMMC_NISTER) Transfer Complete Status Enable Mask */
#define SDMMC_NISTER_SD_SDIO_TRFC(value)      (SDMMC_NISTER_SD_SDIO_TRFC_Msk & ((value) << SDMMC_NISTER_SD_SDIO_TRFC_Pos))
#define   SDMMC_NISTER_SD_SDIO_TRFC_MASKED_Val _U_(0x0)                                             /**< (SDMMC_NISTER) The TRFC status flag in SDMMC_NISTR is masked.  */
#define   SDMMC_NISTER_SD_SDIO_TRFC_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_NISTER) The TRFC status flag in SDMMC_NISTR is enabled.  */
#define SDMMC_NISTER_SD_SDIO_TRFC_MASKED      (SDMMC_NISTER_SD_SDIO_TRFC_MASKED_Val << SDMMC_NISTER_SD_SDIO_TRFC_Pos) /**< (SDMMC_NISTER) The TRFC status flag in SDMMC_NISTR is masked. Position  */
#define SDMMC_NISTER_SD_SDIO_TRFC_ENABLED     (SDMMC_NISTER_SD_SDIO_TRFC_ENABLED_Val << SDMMC_NISTER_SD_SDIO_TRFC_Pos) /**< (SDMMC_NISTER) The TRFC status flag in SDMMC_NISTR is enabled. Position  */
#define SDMMC_NISTER_SD_SDIO_BLKGE_Pos        _U_(2)                                               /**< (SDMMC_NISTER) Block Gap Event Status Enable Position */
#define SDMMC_NISTER_SD_SDIO_BLKGE_Msk        (_U_(0x1) << SDMMC_NISTER_SD_SDIO_BLKGE_Pos)         /**< (SDMMC_NISTER) Block Gap Event Status Enable Mask */
#define SDMMC_NISTER_SD_SDIO_BLKGE(value)     (SDMMC_NISTER_SD_SDIO_BLKGE_Msk & ((value) << SDMMC_NISTER_SD_SDIO_BLKGE_Pos))
#define   SDMMC_NISTER_SD_SDIO_BLKGE_MASKED_Val _U_(0x0)                                             /**< (SDMMC_NISTER) The BLKGE status flag in SDMMC_NISTR is masked.  */
#define   SDMMC_NISTER_SD_SDIO_BLKGE_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_NISTER) The BLKGE status flag in SDMMC_NISTR is enabled.  */
#define SDMMC_NISTER_SD_SDIO_BLKGE_MASKED     (SDMMC_NISTER_SD_SDIO_BLKGE_MASKED_Val << SDMMC_NISTER_SD_SDIO_BLKGE_Pos) /**< (SDMMC_NISTER) The BLKGE status flag in SDMMC_NISTR is masked. Position  */
#define SDMMC_NISTER_SD_SDIO_BLKGE_ENABLED    (SDMMC_NISTER_SD_SDIO_BLKGE_ENABLED_Val << SDMMC_NISTER_SD_SDIO_BLKGE_Pos) /**< (SDMMC_NISTER) The BLKGE status flag in SDMMC_NISTR is enabled. Position  */
#define SDMMC_NISTER_SD_SDIO_DMAINT_Pos       _U_(3)                                               /**< (SDMMC_NISTER) DMA Interrupt Status Enable Position */
#define SDMMC_NISTER_SD_SDIO_DMAINT_Msk       (_U_(0x1) << SDMMC_NISTER_SD_SDIO_DMAINT_Pos)        /**< (SDMMC_NISTER) DMA Interrupt Status Enable Mask */
#define SDMMC_NISTER_SD_SDIO_DMAINT(value)    (SDMMC_NISTER_SD_SDIO_DMAINT_Msk & ((value) << SDMMC_NISTER_SD_SDIO_DMAINT_Pos))
#define   SDMMC_NISTER_SD_SDIO_DMAINT_MASKED_Val _U_(0x0)                                             /**< (SDMMC_NISTER) The DMAINT status flag in SDMMC_NISTR is masked.  */
#define   SDMMC_NISTER_SD_SDIO_DMAINT_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_NISTER) The DMAINT status flag in SDMMC_NISTR is enabled.  */
#define SDMMC_NISTER_SD_SDIO_DMAINT_MASKED    (SDMMC_NISTER_SD_SDIO_DMAINT_MASKED_Val << SDMMC_NISTER_SD_SDIO_DMAINT_Pos) /**< (SDMMC_NISTER) The DMAINT status flag in SDMMC_NISTR is masked. Position  */
#define SDMMC_NISTER_SD_SDIO_DMAINT_ENABLED   (SDMMC_NISTER_SD_SDIO_DMAINT_ENABLED_Val << SDMMC_NISTER_SD_SDIO_DMAINT_Pos) /**< (SDMMC_NISTER) The DMAINT status flag in SDMMC_NISTR is enabled. Position  */
#define SDMMC_NISTER_SD_SDIO_BWRRDY_Pos       _U_(4)                                               /**< (SDMMC_NISTER) Buffer Write Ready Status Enable Position */
#define SDMMC_NISTER_SD_SDIO_BWRRDY_Msk       (_U_(0x1) << SDMMC_NISTER_SD_SDIO_BWRRDY_Pos)        /**< (SDMMC_NISTER) Buffer Write Ready Status Enable Mask */
#define SDMMC_NISTER_SD_SDIO_BWRRDY(value)    (SDMMC_NISTER_SD_SDIO_BWRRDY_Msk & ((value) << SDMMC_NISTER_SD_SDIO_BWRRDY_Pos))
#define   SDMMC_NISTER_SD_SDIO_BWRRDY_MASKED_Val _U_(0x0)                                             /**< (SDMMC_NISTER) The BWRRDY status flag in SDMMC_NISTR is masked.  */
#define   SDMMC_NISTER_SD_SDIO_BWRRDY_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_NISTER) The BWRRDY status flag in SDMMC_NISTR is enabled.  */
#define SDMMC_NISTER_SD_SDIO_BWRRDY_MASKED    (SDMMC_NISTER_SD_SDIO_BWRRDY_MASKED_Val << SDMMC_NISTER_SD_SDIO_BWRRDY_Pos) /**< (SDMMC_NISTER) The BWRRDY status flag in SDMMC_NISTR is masked. Position  */
#define SDMMC_NISTER_SD_SDIO_BWRRDY_ENABLED   (SDMMC_NISTER_SD_SDIO_BWRRDY_ENABLED_Val << SDMMC_NISTER_SD_SDIO_BWRRDY_Pos) /**< (SDMMC_NISTER) The BWRRDY status flag in SDMMC_NISTR is enabled. Position  */
#define SDMMC_NISTER_SD_SDIO_BRDRDY_Pos       _U_(5)                                               /**< (SDMMC_NISTER) Buffer Read Ready Status Enable Position */
#define SDMMC_NISTER_SD_SDIO_BRDRDY_Msk       (_U_(0x1) << SDMMC_NISTER_SD_SDIO_BRDRDY_Pos)        /**< (SDMMC_NISTER) Buffer Read Ready Status Enable Mask */
#define SDMMC_NISTER_SD_SDIO_BRDRDY(value)    (SDMMC_NISTER_SD_SDIO_BRDRDY_Msk & ((value) << SDMMC_NISTER_SD_SDIO_BRDRDY_Pos))
#define   SDMMC_NISTER_SD_SDIO_BRDRDY_MASKED_Val _U_(0x0)                                             /**< (SDMMC_NISTER) The BRDRDY status flag in SDMMC_NISTR is masked.  */
#define   SDMMC_NISTER_SD_SDIO_BRDRDY_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_NISTER) The BRDRDY status flag in SDMMC_NISTR is enabled.  */
#define SDMMC_NISTER_SD_SDIO_BRDRDY_MASKED    (SDMMC_NISTER_SD_SDIO_BRDRDY_MASKED_Val << SDMMC_NISTER_SD_SDIO_BRDRDY_Pos) /**< (SDMMC_NISTER) The BRDRDY status flag in SDMMC_NISTR is masked. Position  */
#define SDMMC_NISTER_SD_SDIO_BRDRDY_ENABLED   (SDMMC_NISTER_SD_SDIO_BRDRDY_ENABLED_Val << SDMMC_NISTER_SD_SDIO_BRDRDY_Pos) /**< (SDMMC_NISTER) The BRDRDY status flag in SDMMC_NISTR is enabled. Position  */
#define SDMMC_NISTER_SD_SDIO_CINS_Pos         _U_(6)                                               /**< (SDMMC_NISTER) Card Insertion Status Enable Position */
#define SDMMC_NISTER_SD_SDIO_CINS_Msk         (_U_(0x1) << SDMMC_NISTER_SD_SDIO_CINS_Pos)          /**< (SDMMC_NISTER) Card Insertion Status Enable Mask */
#define SDMMC_NISTER_SD_SDIO_CINS(value)      (SDMMC_NISTER_SD_SDIO_CINS_Msk & ((value) << SDMMC_NISTER_SD_SDIO_CINS_Pos))
#define   SDMMC_NISTER_SD_SDIO_CINS_MASKED_Val _U_(0x0)                                             /**< (SDMMC_NISTER) The CINS status flag in SDMMC_NISTR is masked.  */
#define   SDMMC_NISTER_SD_SDIO_CINS_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_NISTER) The CINS status flag in SDMMC_NISTR is enabled.  */
#define SDMMC_NISTER_SD_SDIO_CINS_MASKED      (SDMMC_NISTER_SD_SDIO_CINS_MASKED_Val << SDMMC_NISTER_SD_SDIO_CINS_Pos) /**< (SDMMC_NISTER) The CINS status flag in SDMMC_NISTR is masked. Position  */
#define SDMMC_NISTER_SD_SDIO_CINS_ENABLED     (SDMMC_NISTER_SD_SDIO_CINS_ENABLED_Val << SDMMC_NISTER_SD_SDIO_CINS_Pos) /**< (SDMMC_NISTER) The CINS status flag in SDMMC_NISTR is enabled. Position  */
#define SDMMC_NISTER_SD_SDIO_CREM_Pos         _U_(7)                                               /**< (SDMMC_NISTER) Card Removal Status Enable Position */
#define SDMMC_NISTER_SD_SDIO_CREM_Msk         (_U_(0x1) << SDMMC_NISTER_SD_SDIO_CREM_Pos)          /**< (SDMMC_NISTER) Card Removal Status Enable Mask */
#define SDMMC_NISTER_SD_SDIO_CREM(value)      (SDMMC_NISTER_SD_SDIO_CREM_Msk & ((value) << SDMMC_NISTER_SD_SDIO_CREM_Pos))
#define   SDMMC_NISTER_SD_SDIO_CREM_MASKED_Val _U_(0x0)                                             /**< (SDMMC_NISTER) The CREM status flag in SDMMC_NISTR is masked.  */
#define   SDMMC_NISTER_SD_SDIO_CREM_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_NISTER) The CREM status flag in SDMMC_NISTR is enabled.  */
#define SDMMC_NISTER_SD_SDIO_CREM_MASKED      (SDMMC_NISTER_SD_SDIO_CREM_MASKED_Val << SDMMC_NISTER_SD_SDIO_CREM_Pos) /**< (SDMMC_NISTER) The CREM status flag in SDMMC_NISTR is masked. Position  */
#define SDMMC_NISTER_SD_SDIO_CREM_ENABLED     (SDMMC_NISTER_SD_SDIO_CREM_ENABLED_Val << SDMMC_NISTER_SD_SDIO_CREM_Pos) /**< (SDMMC_NISTER) The CREM status flag in SDMMC_NISTR is enabled. Position  */
#define SDMMC_NISTER_SD_SDIO_CINT_Pos         _U_(8)                                               /**< (SDMMC_NISTER) Card Interrupt Status Enable Position */
#define SDMMC_NISTER_SD_SDIO_CINT_Msk         (_U_(0x1) << SDMMC_NISTER_SD_SDIO_CINT_Pos)          /**< (SDMMC_NISTER) Card Interrupt Status Enable Mask */
#define SDMMC_NISTER_SD_SDIO_CINT(value)      (SDMMC_NISTER_SD_SDIO_CINT_Msk & ((value) << SDMMC_NISTER_SD_SDIO_CINT_Pos))
#define   SDMMC_NISTER_SD_SDIO_CINT_MASKED_Val _U_(0x0)                                             /**< (SDMMC_NISTER) The CINT status flag in SDMMC_NISTR is masked.  */
#define   SDMMC_NISTER_SD_SDIO_CINT_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_NISTER) The CINT status flag in SDMMC_NISTR is enabled.  */
#define SDMMC_NISTER_SD_SDIO_CINT_MASKED      (SDMMC_NISTER_SD_SDIO_CINT_MASKED_Val << SDMMC_NISTER_SD_SDIO_CINT_Pos) /**< (SDMMC_NISTER) The CINT status flag in SDMMC_NISTR is masked. Position  */
#define SDMMC_NISTER_SD_SDIO_CINT_ENABLED     (SDMMC_NISTER_SD_SDIO_CINT_ENABLED_Val << SDMMC_NISTER_SD_SDIO_CINT_Pos) /**< (SDMMC_NISTER) The CINT status flag in SDMMC_NISTR is enabled. Position  */
#define SDMMC_NISTER_SD_SDIO_Msk              _U_(0x01FF)                                           /**< (SDMMC_NISTER_SD_SDIO) Register Mask  */

