Microchip-MPLAB-Harmony/csp/apps/flexcom/flexcom_spi_eeprom/firmware/src/packs/ATSAMA5D27_DFP/component/sdmmc.h
/* E_MMC mode */
#define SDMMC_EISTER_E_MMC_CMDTEO_Pos         _U_(0)                                               /**< (SDMMC_EISTER) Command Timeout Error Status Enable Position */
#define SDMMC_EISTER_E_MMC_CMDTEO_Msk         (_U_(0x1) << SDMMC_EISTER_E_MMC_CMDTEO_Pos)          /**< (SDMMC_EISTER) Command Timeout Error Status Enable Mask */
#define SDMMC_EISTER_E_MMC_CMDTEO(value)      (SDMMC_EISTER_E_MMC_CMDTEO_Msk & ((value) << SDMMC_EISTER_E_MMC_CMDTEO_Pos))
#define   SDMMC_EISTER_E_MMC_CMDTEO_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISTER) The CMDTEO status flag in SDMMC_EISTR is masked.  */
#define   SDMMC_EISTER_E_MMC_CMDTEO_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISTER) The CMDTEO status flag in SDMMC_EISTR is enabled.  */
#define SDMMC_EISTER_E_MMC_CMDTEO_MASKED      (SDMMC_EISTER_E_MMC_CMDTEO_MASKED_Val << SDMMC_EISTER_E_MMC_CMDTEO_Pos) /**< (SDMMC_EISTER) The CMDTEO status flag in SDMMC_EISTR is masked. Position  */
#define SDMMC_EISTER_E_MMC_CMDTEO_ENABLED     (SDMMC_EISTER_E_MMC_CMDTEO_ENABLED_Val << SDMMC_EISTER_E_MMC_CMDTEO_Pos) /**< (SDMMC_EISTER) The CMDTEO status flag in SDMMC_EISTR is enabled. Position  */
#define SDMMC_EISTER_E_MMC_CMDCRC_Pos         _U_(1)                                               /**< (SDMMC_EISTER) Command CRC Error Status Enable Position */
#define SDMMC_EISTER_E_MMC_CMDCRC_Msk         (_U_(0x1) << SDMMC_EISTER_E_MMC_CMDCRC_Pos)          /**< (SDMMC_EISTER) Command CRC Error Status Enable Mask */
#define SDMMC_EISTER_E_MMC_CMDCRC(value)      (SDMMC_EISTER_E_MMC_CMDCRC_Msk & ((value) << SDMMC_EISTER_E_MMC_CMDCRC_Pos))
#define   SDMMC_EISTER_E_MMC_CMDCRC_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISTER) The CMDCRC status flag in SDMMC_EISTR is masked.  */
#define   SDMMC_EISTER_E_MMC_CMDCRC_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISTER) The CMDCRC status flag in SDMMC_EISTR is enabled.  */
#define SDMMC_EISTER_E_MMC_CMDCRC_MASKED      (SDMMC_EISTER_E_MMC_CMDCRC_MASKED_Val << SDMMC_EISTER_E_MMC_CMDCRC_Pos) /**< (SDMMC_EISTER) The CMDCRC status flag in SDMMC_EISTR is masked. Position  */
#define SDMMC_EISTER_E_MMC_CMDCRC_ENABLED     (SDMMC_EISTER_E_MMC_CMDCRC_ENABLED_Val << SDMMC_EISTER_E_MMC_CMDCRC_Pos) /**< (SDMMC_EISTER) The CMDCRC status flag in SDMMC_EISTR is enabled. Position  */
#define SDMMC_EISTER_E_MMC_CMDEND_Pos         _U_(2)                                               /**< (SDMMC_EISTER) Command End Bit Error Status Enable Position */
#define SDMMC_EISTER_E_MMC_CMDEND_Msk         (_U_(0x1) << SDMMC_EISTER_E_MMC_CMDEND_Pos)          /**< (SDMMC_EISTER) Command End Bit Error Status Enable Mask */
#define SDMMC_EISTER_E_MMC_CMDEND(value)      (SDMMC_EISTER_E_MMC_CMDEND_Msk & ((value) << SDMMC_EISTER_E_MMC_CMDEND_Pos))
#define   SDMMC_EISTER_E_MMC_CMDEND_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISTER) The CMDEND status flag in SDMMC_EISTR is masked.  */
#define   SDMMC_EISTER_E_MMC_CMDEND_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISTER) The CMDEND status flag in SDMMC_EISTR is enabled.  */
#define SDMMC_EISTER_E_MMC_CMDEND_MASKED      (SDMMC_EISTER_E_MMC_CMDEND_MASKED_Val << SDMMC_EISTER_E_MMC_CMDEND_Pos) /**< (SDMMC_EISTER) The CMDEND status flag in SDMMC_EISTR is masked. Position  */
#define SDMMC_EISTER_E_MMC_CMDEND_ENABLED     (SDMMC_EISTER_E_MMC_CMDEND_ENABLED_Val << SDMMC_EISTER_E_MMC_CMDEND_Pos) /**< (SDMMC_EISTER) The CMDEND status flag in SDMMC_EISTR is enabled. Position  */
#define SDMMC_EISTER_E_MMC_CMDIDX_Pos         _U_(3)                                               /**< (SDMMC_EISTER) Command Index Error Status Enable Position */
#define SDMMC_EISTER_E_MMC_CMDIDX_Msk         (_U_(0x1) << SDMMC_EISTER_E_MMC_CMDIDX_Pos)          /**< (SDMMC_EISTER) Command Index Error Status Enable Mask */
#define SDMMC_EISTER_E_MMC_CMDIDX(value)      (SDMMC_EISTER_E_MMC_CMDIDX_Msk & ((value) << SDMMC_EISTER_E_MMC_CMDIDX_Pos))
#define   SDMMC_EISTER_E_MMC_CMDIDX_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISTER) The CMDIDX status flag in SDMMC_EISTR is masked.  */
#define   SDMMC_EISTER_E_MMC_CMDIDX_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISTER) The CMDIDX status flag in SDMMC_EISTR is enabled.  */
#define SDMMC_EISTER_E_MMC_CMDIDX_MASKED      (SDMMC_EISTER_E_MMC_CMDIDX_MASKED_Val << SDMMC_EISTER_E_MMC_CMDIDX_Pos) /**< (SDMMC_EISTER) The CMDIDX status flag in SDMMC_EISTR is masked. Position  */
#define SDMMC_EISTER_E_MMC_CMDIDX_ENABLED     (SDMMC_EISTER_E_MMC_CMDIDX_ENABLED_Val << SDMMC_EISTER_E_MMC_CMDIDX_Pos) /**< (SDMMC_EISTER) The CMDIDX status flag in SDMMC_EISTR is enabled. Position  */
#define SDMMC_EISTER_E_MMC_DATTEO_Pos         _U_(4)                                               /**< (SDMMC_EISTER) Data Timeout Error Status Enable Position */
#define SDMMC_EISTER_E_MMC_DATTEO_Msk         (_U_(0x1) << SDMMC_EISTER_E_MMC_DATTEO_Pos)          /**< (SDMMC_EISTER) Data Timeout Error Status Enable Mask */
#define SDMMC_EISTER_E_MMC_DATTEO(value)      (SDMMC_EISTER_E_MMC_DATTEO_Msk & ((value) << SDMMC_EISTER_E_MMC_DATTEO_Pos))
#define   SDMMC_EISTER_E_MMC_DATTEO_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISTER) The DATTEO status flag in SDMMC_EISTR is masked.  */
#define   SDMMC_EISTER_E_MMC_DATTEO_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISTER) The DATTEO status flag in SDMMC_EISTR is enabled.  */
#define SDMMC_EISTER_E_MMC_DATTEO_MASKED      (SDMMC_EISTER_E_MMC_DATTEO_MASKED_Val << SDMMC_EISTER_E_MMC_DATTEO_Pos) /**< (SDMMC_EISTER) The DATTEO status flag in SDMMC_EISTR is masked. Position  */
#define SDMMC_EISTER_E_MMC_DATTEO_ENABLED     (SDMMC_EISTER_E_MMC_DATTEO_ENABLED_Val << SDMMC_EISTER_E_MMC_DATTEO_Pos) /**< (SDMMC_EISTER) The DATTEO status flag in SDMMC_EISTR is enabled. Position  */
#define SDMMC_EISTER_E_MMC_DATCRC_Pos         _U_(5)                                               /**< (SDMMC_EISTER) Data CRC Error Status Enable Position */
#define SDMMC_EISTER_E_MMC_DATCRC_Msk         (_U_(0x1) << SDMMC_EISTER_E_MMC_DATCRC_Pos)          /**< (SDMMC_EISTER) Data CRC Error Status Enable Mask */
#define SDMMC_EISTER_E_MMC_DATCRC(value)      (SDMMC_EISTER_E_MMC_DATCRC_Msk & ((value) << SDMMC_EISTER_E_MMC_DATCRC_Pos))
#define   SDMMC_EISTER_E_MMC_DATCRC_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISTER) The DATCRC status flag in SDMMC_EISTR is masked.  */
#define   SDMMC_EISTER_E_MMC_DATCRC_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISTER) The DATCRC status flag in SDMMC_EISTR is enabled.  */
#define SDMMC_EISTER_E_MMC_DATCRC_MASKED      (SDMMC_EISTER_E_MMC_DATCRC_MASKED_Val << SDMMC_EISTER_E_MMC_DATCRC_Pos) /**< (SDMMC_EISTER) The DATCRC status flag in SDMMC_EISTR is masked. Position  */
#define SDMMC_EISTER_E_MMC_DATCRC_ENABLED     (SDMMC_EISTER_E_MMC_DATCRC_ENABLED_Val << SDMMC_EISTER_E_MMC_DATCRC_Pos) /**< (SDMMC_EISTER) The DATCRC status flag in SDMMC_EISTR is enabled. Position  */
#define SDMMC_EISTER_E_MMC_DATEND_Pos         _U_(6)                                               /**< (SDMMC_EISTER) Data End Bit Error Status Enable Position */
#define SDMMC_EISTER_E_MMC_DATEND_Msk         (_U_(0x1) << SDMMC_EISTER_E_MMC_DATEND_Pos)          /**< (SDMMC_EISTER) Data End Bit Error Status Enable Mask */
#define SDMMC_EISTER_E_MMC_DATEND(value)      (SDMMC_EISTER_E_MMC_DATEND_Msk & ((value) << SDMMC_EISTER_E_MMC_DATEND_Pos))
#define   SDMMC_EISTER_E_MMC_DATEND_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISTER) The DATEND status flag in SDMMC_EISTR is masked.  */
#define   SDMMC_EISTER_E_MMC_DATEND_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISTER) The DATEND status flag in SDMMC_EISTR is enabled.  */
#define SDMMC_EISTER_E_MMC_DATEND_MASKED      (SDMMC_EISTER_E_MMC_DATEND_MASKED_Val << SDMMC_EISTER_E_MMC_DATEND_Pos) /**< (SDMMC_EISTER) The DATEND status flag in SDMMC_EISTR is masked. Position  */
#define SDMMC_EISTER_E_MMC_DATEND_ENABLED     (SDMMC_EISTER_E_MMC_DATEND_ENABLED_Val << SDMMC_EISTER_E_MMC_DATEND_Pos) /**< (SDMMC_EISTER) The DATEND status flag in SDMMC_EISTR is enabled. Position  */
#define SDMMC_EISTER_E_MMC_CURLIM_Pos         _U_(7)                                               /**< (SDMMC_EISTER) Current Limit Error Status Enable Position */
#define SDMMC_EISTER_E_MMC_CURLIM_Msk         (_U_(0x1) << SDMMC_EISTER_E_MMC_CURLIM_Pos)          /**< (SDMMC_EISTER) Current Limit Error Status Enable Mask */
#define SDMMC_EISTER_E_MMC_CURLIM(value)      (SDMMC_EISTER_E_MMC_CURLIM_Msk & ((value) << SDMMC_EISTER_E_MMC_CURLIM_Pos))
#define   SDMMC_EISTER_E_MMC_CURLIM_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISTER) The CURLIM status flag in SDMMC_EISTR is masked.  */
#define   SDMMC_EISTER_E_MMC_CURLIM_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISTER) The CURLIM status flag in SDMMC_EISTR is enabled.  */
#define SDMMC_EISTER_E_MMC_CURLIM_MASKED      (SDMMC_EISTER_E_MMC_CURLIM_MASKED_Val << SDMMC_EISTER_E_MMC_CURLIM_Pos) /**< (SDMMC_EISTER) The CURLIM status flag in SDMMC_EISTR is masked. Position  */
#define SDMMC_EISTER_E_MMC_CURLIM_ENABLED     (SDMMC_EISTER_E_MMC_CURLIM_ENABLED_Val << SDMMC_EISTER_E_MMC_CURLIM_Pos) /**< (SDMMC_EISTER) The CURLIM status flag in SDMMC_EISTR is enabled. Position  */
#define SDMMC_EISTER_E_MMC_ACMD_Pos           _U_(8)                                               /**< (SDMMC_EISTER) Auto CMD Error Status Enable Position */
#define SDMMC_EISTER_E_MMC_ACMD_Msk           (_U_(0x1) << SDMMC_EISTER_E_MMC_ACMD_Pos)            /**< (SDMMC_EISTER) Auto CMD Error Status Enable Mask */
#define SDMMC_EISTER_E_MMC_ACMD(value)        (SDMMC_EISTER_E_MMC_ACMD_Msk & ((value) << SDMMC_EISTER_E_MMC_ACMD_Pos))
#define   SDMMC_EISTER_E_MMC_ACMD_MASKED_Val  _U_(0x0)                                             /**< (SDMMC_EISTER) The ACMD status flag in SDMMC_EISTR is masked.  */
#define   SDMMC_EISTER_E_MMC_ACMD_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISTER) The ACMD status flag in SDMMC_EISTR is enabled.  */
#define SDMMC_EISTER_E_MMC_ACMD_MASKED        (SDMMC_EISTER_E_MMC_ACMD_MASKED_Val << SDMMC_EISTER_E_MMC_ACMD_Pos) /**< (SDMMC_EISTER) The ACMD status flag in SDMMC_EISTR is masked. Position  */
#define SDMMC_EISTER_E_MMC_ACMD_ENABLED       (SDMMC_EISTER_E_MMC_ACMD_ENABLED_Val << SDMMC_EISTER_E_MMC_ACMD_Pos) /**< (SDMMC_EISTER) The ACMD status flag in SDMMC_EISTR is enabled. Position  */
#define SDMMC_EISTER_E_MMC_ADMA_Pos           _U_(9)                                               /**< (SDMMC_EISTER) ADMA Error Status Enable Position */
#define SDMMC_EISTER_E_MMC_ADMA_Msk           (_U_(0x1) << SDMMC_EISTER_E_MMC_ADMA_Pos)            /**< (SDMMC_EISTER) ADMA Error Status Enable Mask */
#define SDMMC_EISTER_E_MMC_ADMA(value)        (SDMMC_EISTER_E_MMC_ADMA_Msk & ((value) << SDMMC_EISTER_E_MMC_ADMA_Pos))
#define   SDMMC_EISTER_E_MMC_ADMA_MASKED_Val  _U_(0x0)                                             /**< (SDMMC_EISTER) The ADMA status flag in SDMMC_EISTR is masked.  */
#define   SDMMC_EISTER_E_MMC_ADMA_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISTER) The ADMA status flag in SDMMC_EISTR is enabled.  */
#define SDMMC_EISTER_E_MMC_ADMA_MASKED        (SDMMC_EISTER_E_MMC_ADMA_MASKED_Val << SDMMC_EISTER_E_MMC_ADMA_Pos) /**< (SDMMC_EISTER) The ADMA status flag in SDMMC_EISTR is masked. Position  */
#define SDMMC_EISTER_E_MMC_ADMA_ENABLED       (SDMMC_EISTER_E_MMC_ADMA_ENABLED_Val << SDMMC_EISTER_E_MMC_ADMA_Pos) /**< (SDMMC_EISTER) The ADMA status flag in SDMMC_EISTR is enabled. Position  */
#define SDMMC_EISTER_E_MMC_BOOTAE_Pos         _U_(12)                                              /**< (SDMMC_EISTER) Boot Acknowledge Error Status Enable Position */
#define SDMMC_EISTER_E_MMC_BOOTAE_Msk         (_U_(0x1) << SDMMC_EISTER_E_MMC_BOOTAE_Pos)          /**< (SDMMC_EISTER) Boot Acknowledge Error Status Enable Mask */
#define SDMMC_EISTER_E_MMC_BOOTAE(value)      (SDMMC_EISTER_E_MMC_BOOTAE_Msk & ((value) << SDMMC_EISTER_E_MMC_BOOTAE_Pos))
#define   SDMMC_EISTER_E_MMC_BOOTAE_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISTER) The BOOTAE status flag in SDMMC_EISTR is masked.  */
#define   SDMMC_EISTER_E_MMC_BOOTAE_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISTER) The BOOTAE status flag in SDMMC_EISTR is enabled.  */
#define SDMMC_EISTER_E_MMC_BOOTAE_MASKED      (SDMMC_EISTER_E_MMC_BOOTAE_MASKED_Val << SDMMC_EISTER_E_MMC_BOOTAE_Pos) /**< (SDMMC_EISTER) The BOOTAE status flag in SDMMC_EISTR is masked. Position  */
#define SDMMC_EISTER_E_MMC_BOOTAE_ENABLED     (SDMMC_EISTER_E_MMC_BOOTAE_ENABLED_Val << SDMMC_EISTER_E_MMC_BOOTAE_Pos) /**< (SDMMC_EISTER) The BOOTAE status flag in SDMMC_EISTR is enabled. Position  */
#define SDMMC_EISTER_E_MMC_Msk                _U_(0x13FF)                                           /**< (SDMMC_EISTER_E_MMC) Register Mask  */


/* -------- SDMMC_NISIER : (SDMMC Offset: 0x38) (R/W 16) Normal Interrupt Signal Enable Register -------- */
#define SDMMC_NISIER_Msk                      _U_(0x0000)                                          /**< (SDMMC_NISIER) Register Mask  */

