Microchip-MPLAB-Harmony/csp/apps/flexcom/flexcom_spi_eeprom/firmware/src/packs/ATSAMA5D27_DFP/component/sdmmc.h
/* E_MMC mode */
#define SDMMC_HC2R_E_MMC_HS200EN_Pos          _U_(0)                                               /**< (SDMMC_HC2R) HS200 Mode Enable Position */
#define SDMMC_HC2R_E_MMC_HS200EN_Msk          (_U_(0xF) << SDMMC_HC2R_E_MMC_HS200EN_Pos)           /**< (SDMMC_HC2R) HS200 Mode Enable Mask */
#define SDMMC_HC2R_E_MMC_HS200EN(value)       (SDMMC_HC2R_E_MMC_HS200EN_Msk & ((value) << SDMMC_HC2R_E_MMC_HS200EN_Pos))
#define SDMMC_HC2R_E_MMC_DRVSEL_Pos           _U_(4)                                               /**< (SDMMC_HC2R) Driver Strength Select Position */
#define SDMMC_HC2R_E_MMC_DRVSEL_Msk           (_U_(0x3) << SDMMC_HC2R_E_MMC_DRVSEL_Pos)            /**< (SDMMC_HC2R) Driver Strength Select Mask */
#define SDMMC_HC2R_E_MMC_DRVSEL(value)        (SDMMC_HC2R_E_MMC_DRVSEL_Msk & ((value) << SDMMC_HC2R_E_MMC_DRVSEL_Pos))
#define   SDMMC_HC2R_E_MMC_DRVSEL_TYPEB_Val   _U_(0x0)                                             /**< (SDMMC_HC2R) Driver Type B is selected (Default)  */
#define   SDMMC_HC2R_E_MMC_DRVSEL_TYPEA_Val   _U_(0x1)                                             /**< (SDMMC_HC2R) Driver Type A is selected  */
#define   SDMMC_HC2R_E_MMC_DRVSEL_TYPEC_Val   _U_(0x2)                                             /**< (SDMMC_HC2R) Driver Type C is selected  */
#define   SDMMC_HC2R_E_MMC_DRVSEL_TYPED_Val   _U_(0x3)                                             /**< (SDMMC_HC2R) Driver Type D is selected  */
#define SDMMC_HC2R_E_MMC_DRVSEL_TYPEB         (SDMMC_HC2R_E_MMC_DRVSEL_TYPEB_Val << SDMMC_HC2R_E_MMC_DRVSEL_Pos) /**< (SDMMC_HC2R) Driver Type B is selected (Default) Position  */
#define SDMMC_HC2R_E_MMC_DRVSEL_TYPEA         (SDMMC_HC2R_E_MMC_DRVSEL_TYPEA_Val << SDMMC_HC2R_E_MMC_DRVSEL_Pos) /**< (SDMMC_HC2R) Driver Type A is selected Position  */
#define SDMMC_HC2R_E_MMC_DRVSEL_TYPEC         (SDMMC_HC2R_E_MMC_DRVSEL_TYPEC_Val << SDMMC_HC2R_E_MMC_DRVSEL_Pos) /**< (SDMMC_HC2R) Driver Type C is selected Position  */
#define SDMMC_HC2R_E_MMC_DRVSEL_TYPED         (SDMMC_HC2R_E_MMC_DRVSEL_TYPED_Val << SDMMC_HC2R_E_MMC_DRVSEL_Pos) /**< (SDMMC_HC2R) Driver Type D is selected Position  */
#define SDMMC_HC2R_E_MMC_EXTUN_Pos            _U_(6)                                               /**< (SDMMC_HC2R) Execute Tuning Position */
#define SDMMC_HC2R_E_MMC_EXTUN_Msk            (_U_(0x1) << SDMMC_HC2R_E_MMC_EXTUN_Pos)             /**< (SDMMC_HC2R) Execute Tuning Mask */
#define SDMMC_HC2R_E_MMC_EXTUN(value)         (SDMMC_HC2R_E_MMC_EXTUN_Msk & ((value) << SDMMC_HC2R_E_MMC_EXTUN_Pos))
#define SDMMC_HC2R_E_MMC_SCLKSEL_Pos          _U_(7)                                               /**< (SDMMC_HC2R) Sampling Clock Select Position */
#define SDMMC_HC2R_E_MMC_SCLKSEL_Msk          (_U_(0x1) << SDMMC_HC2R_E_MMC_SCLKSEL_Pos)           /**< (SDMMC_HC2R) Sampling Clock Select Mask */
#define SDMMC_HC2R_E_MMC_SCLKSEL(value)       (SDMMC_HC2R_E_MMC_SCLKSEL_Msk & ((value) << SDMMC_HC2R_E_MMC_SCLKSEL_Pos))
#define SDMMC_HC2R_E_MMC_PVALEN_Pos           _U_(15)                                              /**< (SDMMC_HC2R) Preset Value Enable Position */
#define SDMMC_HC2R_E_MMC_PVALEN_Msk           (_U_(0x1) << SDMMC_HC2R_E_MMC_PVALEN_Pos)            /**< (SDMMC_HC2R) Preset Value Enable Mask */
#define SDMMC_HC2R_E_MMC_PVALEN(value)        (SDMMC_HC2R_E_MMC_PVALEN_Msk & ((value) << SDMMC_HC2R_E_MMC_PVALEN_Pos))
#define SDMMC_HC2R_E_MMC_Msk                  _U_(0x80FF)                                           /**< (SDMMC_HC2R_E_MMC) Register Mask  */


/* -------- SDMMC_CA0R : (SDMMC Offset: 0x40) ( R/ 32) Capabilities 0 Register -------- */
#define SDMMC_CA0R_TEOCLKF_Pos                _U_(0)                                               /**< (SDMMC_CA0R) Timeout Clock Frequency Position */
#define SDMMC_CA0R_TEOCLKF_Msk                (_U_(0x3F) << SDMMC_CA0R_TEOCLKF_Pos)                /**< (SDMMC_CA0R) Timeout Clock Frequency Mask */
#define SDMMC_CA0R_TEOCLKF(value)             (SDMMC_CA0R_TEOCLKF_Msk & ((value) << SDMMC_CA0R_TEOCLKF_Pos))
#define SDMMC_CA0R_TEOCLKU_Pos                _U_(7)                                               /**< (SDMMC_CA0R) Timeout Clock Unit Position */
#define SDMMC_CA0R_TEOCLKU_Msk                (_U_(0x1) << SDMMC_CA0R_TEOCLKU_Pos)                 /**< (SDMMC_CA0R) Timeout Clock Unit Mask */
#define SDMMC_CA0R_TEOCLKU(value)             (SDMMC_CA0R_TEOCLKU_Msk & ((value) << SDMMC_CA0R_TEOCLKU_Pos))
#define SDMMC_CA0R_BASECLKF_Pos               _U_(8)                                               /**< (SDMMC_CA0R) Base Clock Frequency Position */
#define SDMMC_CA0R_BASECLKF_Msk               (_U_(0xFF) << SDMMC_CA0R_BASECLKF_Pos)               /**< (SDMMC_CA0R) Base Clock Frequency Mask */
#define SDMMC_CA0R_BASECLKF(value)            (SDMMC_CA0R_BASECLKF_Msk & ((value) << SDMMC_CA0R_BASECLKF_Pos))
#define SDMMC_CA0R_MAXBLKL_Pos                _U_(16)                                              /**< (SDMMC_CA0R) Max Block Length Position */
#define SDMMC_CA0R_MAXBLKL_Msk                (_U_(0x3) << SDMMC_CA0R_MAXBLKL_Pos)                 /**< (SDMMC_CA0R) Max Block Length Mask */
#define SDMMC_CA0R_MAXBLKL(value)             (SDMMC_CA0R_MAXBLKL_Msk & ((value) << SDMMC_CA0R_MAXBLKL_Pos))
#define   SDMMC_CA0R_MAXBLKL_512_Val          _U_(0x0)                                             /**< (SDMMC_CA0R) 512 bytes  */
#define   SDMMC_CA0R_MAXBLKL_1024_Val         _U_(0x1)                                             /**< (SDMMC_CA0R) 1024 bytes  */
#define   SDMMC_CA0R_MAXBLKL_2048_Val         _U_(0x2)                                             /**< (SDMMC_CA0R) 2048 bytes  */
#define SDMMC_CA0R_MAXBLKL_512                (SDMMC_CA0R_MAXBLKL_512_Val << SDMMC_CA0R_MAXBLKL_Pos) /**< (SDMMC_CA0R) 512 bytes Position  */
#define SDMMC_CA0R_MAXBLKL_1024               (SDMMC_CA0R_MAXBLKL_1024_Val << SDMMC_CA0R_MAXBLKL_Pos) /**< (SDMMC_CA0R) 1024 bytes Position  */
#define SDMMC_CA0R_MAXBLKL_2048               (SDMMC_CA0R_MAXBLKL_2048_Val << SDMMC_CA0R_MAXBLKL_Pos) /**< (SDMMC_CA0R) 2048 bytes Position  */
#define SDMMC_CA0R_ED8SUP_Pos                 _U_(18)                                              /**< (SDMMC_CA0R) 8-Bit Support for Embedded Device Position */
#define SDMMC_CA0R_ED8SUP_Msk                 (_U_(0x1) << SDMMC_CA0R_ED8SUP_Pos)                  /**< (SDMMC_CA0R) 8-Bit Support for Embedded Device Mask */
#define SDMMC_CA0R_ED8SUP(value)              (SDMMC_CA0R_ED8SUP_Msk & ((value) << SDMMC_CA0R_ED8SUP_Pos))
#define SDMMC_CA0R_ADMA2SUP_Pos               _U_(19)                                              /**< (SDMMC_CA0R) ADMA2 Support Position */
#define SDMMC_CA0R_ADMA2SUP_Msk               (_U_(0x1) << SDMMC_CA0R_ADMA2SUP_Pos)                /**< (SDMMC_CA0R) ADMA2 Support Mask */
#define SDMMC_CA0R_ADMA2SUP(value)            (SDMMC_CA0R_ADMA2SUP_Msk & ((value) << SDMMC_CA0R_ADMA2SUP_Pos))
#define SDMMC_CA0R_HSSUP_Pos                  _U_(21)                                              /**< (SDMMC_CA0R) High Speed Support Position */
#define SDMMC_CA0R_HSSUP_Msk                  (_U_(0x1) << SDMMC_CA0R_HSSUP_Pos)                   /**< (SDMMC_CA0R) High Speed Support Mask */
#define SDMMC_CA0R_HSSUP(value)               (SDMMC_CA0R_HSSUP_Msk & ((value) << SDMMC_CA0R_HSSUP_Pos))
#define SDMMC_CA0R_SDMASUP_Pos                _U_(22)                                              /**< (SDMMC_CA0R) SDMA Support Position */
#define SDMMC_CA0R_SDMASUP_Msk                (_U_(0x1) << SDMMC_CA0R_SDMASUP_Pos)                 /**< (SDMMC_CA0R) SDMA Support Mask */
#define SDMMC_CA0R_SDMASUP(value)             (SDMMC_CA0R_SDMASUP_Msk & ((value) << SDMMC_CA0R_SDMASUP_Pos))
#define SDMMC_CA0R_SRSUP_Pos                  _U_(23)                                              /**< (SDMMC_CA0R) Suspend/Resume Support Position */
#define SDMMC_CA0R_SRSUP_Msk                  (_U_(0x1) << SDMMC_CA0R_SRSUP_Pos)                   /**< (SDMMC_CA0R) Suspend/Resume Support Mask */
#define SDMMC_CA0R_SRSUP(value)               (SDMMC_CA0R_SRSUP_Msk & ((value) << SDMMC_CA0R_SRSUP_Pos))
#define SDMMC_CA0R_V33VSUP_Pos                _U_(24)                                              /**< (SDMMC_CA0R) Voltage Support 3.3V Position */
#define SDMMC_CA0R_V33VSUP_Msk                (_U_(0x1) << SDMMC_CA0R_V33VSUP_Pos)                 /**< (SDMMC_CA0R) Voltage Support 3.3V Mask */
#define SDMMC_CA0R_V33VSUP(value)             (SDMMC_CA0R_V33VSUP_Msk & ((value) << SDMMC_CA0R_V33VSUP_Pos))
#define SDMMC_CA0R_V30VSUP_Pos                _U_(25)                                              /**< (SDMMC_CA0R) Voltage Support 3.0V Position */
#define SDMMC_CA0R_V30VSUP_Msk                (_U_(0x1) << SDMMC_CA0R_V30VSUP_Pos)                 /**< (SDMMC_CA0R) Voltage Support 3.0V Mask */
#define SDMMC_CA0R_V30VSUP(value)             (SDMMC_CA0R_V30VSUP_Msk & ((value) << SDMMC_CA0R_V30VSUP_Pos))
#define SDMMC_CA0R_V18VSUP_Pos                _U_(26)                                              /**< (SDMMC_CA0R) Voltage Support 1.8V Position */
#define SDMMC_CA0R_V18VSUP_Msk                (_U_(0x1) << SDMMC_CA0R_V18VSUP_Pos)                 /**< (SDMMC_CA0R) Voltage Support 1.8V Mask */
#define SDMMC_CA0R_V18VSUP(value)             (SDMMC_CA0R_V18VSUP_Msk & ((value) << SDMMC_CA0R_V18VSUP_Pos))
#define SDMMC_CA0R_SB64SUP_Pos                _U_(28)                                              /**< (SDMMC_CA0R) 64-Bit System Bus Support Position */
#define SDMMC_CA0R_SB64SUP_Msk                (_U_(0x1) << SDMMC_CA0R_SB64SUP_Pos)                 /**< (SDMMC_CA0R) 64-Bit System Bus Support Mask */
#define SDMMC_CA0R_SB64SUP(value)             (SDMMC_CA0R_SB64SUP_Msk & ((value) << SDMMC_CA0R_SB64SUP_Pos))
#define SDMMC_CA0R_ASINTSUP_Pos               _U_(29)                                              /**< (SDMMC_CA0R) Asynchronous Interrupt Support Position */
#define SDMMC_CA0R_ASINTSUP_Msk               (_U_(0x1) << SDMMC_CA0R_ASINTSUP_Pos)                /**< (SDMMC_CA0R) Asynchronous Interrupt Support Mask */
#define SDMMC_CA0R_ASINTSUP(value)            (SDMMC_CA0R_ASINTSUP_Msk & ((value) << SDMMC_CA0R_ASINTSUP_Pos))
#define SDMMC_CA0R_SLTYPE_Pos                 _U_(30)                                              /**< (SDMMC_CA0R) Slot Type Position */
#define SDMMC_CA0R_SLTYPE_Msk                 (_U_(0x3) << SDMMC_CA0R_SLTYPE_Pos)                  /**< (SDMMC_CA0R) Slot Type Mask */
#define SDMMC_CA0R_SLTYPE(value)              (SDMMC_CA0R_SLTYPE_Msk & ((value) << SDMMC_CA0R_SLTYPE_Pos))
#define SDMMC_CA0R_Msk                        _U_(0xF7EFFFBF)                                      /**< (SDMMC_CA0R) Register Mask  */


/* -------- SDMMC_CA1R : (SDMMC Offset: 0x44) (R/W 32) Capabilities 1 Register -------- */
#define SDMMC_CA1R_SDR50SUP_Pos               _U_(0)                                               /**< (SDMMC_CA1R) SDR50 Support Position */
#define SDMMC_CA1R_SDR50SUP_Msk               (_U_(0x1) << SDMMC_CA1R_SDR50SUP_Pos)                /**< (SDMMC_CA1R) SDR50 Support Mask */
#define SDMMC_CA1R_SDR50SUP(value)            (SDMMC_CA1R_SDR50SUP_Msk & ((value) << SDMMC_CA1R_SDR50SUP_Pos))
#define SDMMC_CA1R_SDR104SUP_Pos              _U_(1)                                               /**< (SDMMC_CA1R) SDR104 Support Position */
#define SDMMC_CA1R_SDR104SUP_Msk              (_U_(0x1) << SDMMC_CA1R_SDR104SUP_Pos)               /**< (SDMMC_CA1R) SDR104 Support Mask */
#define SDMMC_CA1R_SDR104SUP(value)           (SDMMC_CA1R_SDR104SUP_Msk & ((value) << SDMMC_CA1R_SDR104SUP_Pos))
#define SDMMC_CA1R_DDR50SUP_Pos               _U_(2)                                               /**< (SDMMC_CA1R) DDR50 Support Position */
#define SDMMC_CA1R_DDR50SUP_Msk               (_U_(0x1) << SDMMC_CA1R_DDR50SUP_Pos)                /**< (SDMMC_CA1R) DDR50 Support Mask */
#define SDMMC_CA1R_DDR50SUP(value)            (SDMMC_CA1R_DDR50SUP_Msk & ((value) << SDMMC_CA1R_DDR50SUP_Pos))
#define SDMMC_CA1R_DRVASUP_Pos                _U_(4)                                               /**< (SDMMC_CA1R) Driver Type A Support Position */
#define SDMMC_CA1R_DRVASUP_Msk                (_U_(0x1) << SDMMC_CA1R_DRVASUP_Pos)                 /**< (SDMMC_CA1R) Driver Type A Support Mask */
#define SDMMC_CA1R_DRVASUP(value)             (SDMMC_CA1R_DRVASUP_Msk & ((value) << SDMMC_CA1R_DRVASUP_Pos))
#define SDMMC_CA1R_DRVCSUP_Pos                _U_(5)                                               /**< (SDMMC_CA1R) Driver Type C Support Position */
#define SDMMC_CA1R_DRVCSUP_Msk                (_U_(0x1) << SDMMC_CA1R_DRVCSUP_Pos)                 /**< (SDMMC_CA1R) Driver Type C Support Mask */
#define SDMMC_CA1R_DRVCSUP(value)             (SDMMC_CA1R_DRVCSUP_Msk & ((value) << SDMMC_CA1R_DRVCSUP_Pos))
#define SDMMC_CA1R_DRVDSUP_Pos                _U_(6)                                               /**< (SDMMC_CA1R) Driver Type D Support Position */
#define SDMMC_CA1R_DRVDSUP_Msk                (_U_(0x1) << SDMMC_CA1R_DRVDSUP_Pos)                 /**< (SDMMC_CA1R) Driver Type D Support Mask */
#define SDMMC_CA1R_DRVDSUP(value)             (SDMMC_CA1R_DRVDSUP_Msk & ((value) << SDMMC_CA1R_DRVDSUP_Pos))
#define SDMMC_CA1R_TCNTRT_Pos                 _U_(8)                                               /**< (SDMMC_CA1R) Timer Count For Retuning Position */
#define SDMMC_CA1R_TCNTRT_Msk                 (_U_(0xF) << SDMMC_CA1R_TCNTRT_Pos)                  /**< (SDMMC_CA1R) Timer Count For Retuning Mask */
#define SDMMC_CA1R_TCNTRT(value)              (SDMMC_CA1R_TCNTRT_Msk & ((value) << SDMMC_CA1R_TCNTRT_Pos))
#define SDMMC_CA1R_TSDR50_Pos                 _U_(13)                                              /**< (SDMMC_CA1R) Use Tuning for SDR50 Position */
#define SDMMC_CA1R_TSDR50_Msk                 (_U_(0x1) << SDMMC_CA1R_TSDR50_Pos)                  /**< (SDMMC_CA1R) Use Tuning for SDR50 Mask */
#define SDMMC_CA1R_TSDR50(value)              (SDMMC_CA1R_TSDR50_Msk & ((value) << SDMMC_CA1R_TSDR50_Pos))
#define SDMMC_CA1R_RTMOD_Pos                  _U_(14)                                              /**< (SDMMC_CA1R) Retuning Modes Position */
#define SDMMC_CA1R_RTMOD_Msk                  (_U_(0x3) << SDMMC_CA1R_RTMOD_Pos)                   /**< (SDMMC_CA1R) Retuning Modes Mask */
#define SDMMC_CA1R_RTMOD(value)               (SDMMC_CA1R_RTMOD_Msk & ((value) << SDMMC_CA1R_RTMOD_Pos))
#define   SDMMC_CA1R_RTMOD_MODE1_Val          _U_(0x0)                                             /**< (SDMMC_CA1R) Timer  */
#define   SDMMC_CA1R_RTMOD_MODE2_Val          _U_(0x1)                                             /**< (SDMMC_CA1R) Timer and Retuning Request  */
#define   SDMMC_CA1R_RTMOD_MODE3_Val          _U_(0x2)                                             /**< (SDMMC_CA1R) Auto Retuning (for transfer) Timer and Retuning Request  */
#define SDMMC_CA1R_RTMOD_MODE1                (SDMMC_CA1R_RTMOD_MODE1_Val << SDMMC_CA1R_RTMOD_Pos) /**< (SDMMC_CA1R) Timer Position  */
#define SDMMC_CA1R_RTMOD_MODE2                (SDMMC_CA1R_RTMOD_MODE2_Val << SDMMC_CA1R_RTMOD_Pos) /**< (SDMMC_CA1R) Timer and Retuning Request Position  */
#define SDMMC_CA1R_RTMOD_MODE3                (SDMMC_CA1R_RTMOD_MODE3_Val << SDMMC_CA1R_RTMOD_Pos) /**< (SDMMC_CA1R) Auto Retuning (for transfer) Timer and Retuning Request Position  */
#define SDMMC_CA1R_CLKMULT_Pos                _U_(16)                                              /**< (SDMMC_CA1R) Clock Multiplier Position */
#define SDMMC_CA1R_CLKMULT_Msk                (_U_(0xFF) << SDMMC_CA1R_CLKMULT_Pos)                /**< (SDMMC_CA1R) Clock Multiplier Mask */
#define SDMMC_CA1R_CLKMULT(value)             (SDMMC_CA1R_CLKMULT_Msk & ((value) << SDMMC_CA1R_CLKMULT_Pos))
#define SDMMC_CA1R_Msk                        _U_(0x00FFEF77)                                      /**< (SDMMC_CA1R) Register Mask  */

#define SDMMC_CA1R_TSDR_Pos                   _U_(13)                                              /**< (SDMMC_CA1R Position) Use Tuning for SDR5x */
#define SDMMC_CA1R_TSDR_Msk                   (_U_(0x1) << SDMMC_CA1R_TSDR_Pos)                    /**< (SDMMC_CA1R Mask) TSDR */
#define SDMMC_CA1R_TSDR(value)                (SDMMC_CA1R_TSDR_Msk & ((value) << SDMMC_CA1R_TSDR_Pos)) 

