Microchip-MPLAB-Harmony/csp/apps/flexcom/flexcom_spi_eeprom/firmware/src/packs/ATSAMA5D27_DFP/component/sdmmc.h
/* -------- SDMMC_RTC2R : (SDMMC Offset: 0x211) ( /W 8) Retuning Timer Control 2 Register -------- */
#define SDMMC_RTC2R_RLD_Pos                   _U_(0)                                               /**< (SDMMC_RTC2R) Retuning Timer Reload Position */
#define SDMMC_RTC2R_RLD_Msk                   (_U_(0x1) << SDMMC_RTC2R_RLD_Pos)                    /**< (SDMMC_RTC2R) Retuning Timer Reload Mask */
#define SDMMC_RTC2R_RLD(value)                (SDMMC_RTC2R_RLD_Msk & ((value) << SDMMC_RTC2R_RLD_Pos))
#define SDMMC_RTC2R_Msk                       _U_(0x01)                                            /**< (SDMMC_RTC2R) Register Mask  */


/* -------- SDMMC_RTCVR : (SDMMC Offset: 0x214) (R/W 32) Retuning Timer Counter Value Register -------- */
#define SDMMC_RTCVR_TCVAL_Pos                 _U_(0)                                               /**< (SDMMC_RTCVR) Retuning Timer Counter Value Position */
#define SDMMC_RTCVR_TCVAL_Msk                 (_U_(0xF) << SDMMC_RTCVR_TCVAL_Pos)                  /**< (SDMMC_RTCVR) Retuning Timer Counter Value Mask */
#define SDMMC_RTCVR_TCVAL(value)              (SDMMC_RTCVR_TCVAL_Msk & ((value) << SDMMC_RTCVR_TCVAL_Pos))
#define SDMMC_RTCVR_Msk                       _U_(0x0000000F)                                      /**< (SDMMC_RTCVR) Register Mask  */


/* -------- SDMMC_RTISTER : (SDMMC Offset: 0x218) (R/W 8) Retuning Timer Interrupt Status Enable Register -------- */
#define SDMMC_RTISTER_TEVT_Pos                _U_(0)                                               /**< (SDMMC_RTISTER) Retuning Timer Event Position */
#define SDMMC_RTISTER_TEVT_Msk                (_U_(0x1) << SDMMC_RTISTER_TEVT_Pos)                 /**< (SDMMC_RTISTER) Retuning Timer Event Mask */
#define SDMMC_RTISTER_TEVT(value)             (SDMMC_RTISTER_TEVT_Msk & ((value) << SDMMC_RTISTER_TEVT_Pos))
#define   SDMMC_RTISTER_TEVT_MASKED_Val       _U_(0x0)                                             /**< (SDMMC_RTISTER) The TEVT status flag in SDMMC_RTISTR is masked.  */
#define   SDMMC_RTISTER_TEVT_ENABLED_Val      _U_(0x1)                                             /**< (SDMMC_RTISTER) The TEVT status flag in SDMMC_RTISTR is enabled.  */
#define SDMMC_RTISTER_TEVT_MASKED             (SDMMC_RTISTER_TEVT_MASKED_Val << SDMMC_RTISTER_TEVT_Pos) /**< (SDMMC_RTISTER) The TEVT status flag in SDMMC_RTISTR is masked. Position  */
#define SDMMC_RTISTER_TEVT_ENABLED            (SDMMC_RTISTER_TEVT_ENABLED_Val << SDMMC_RTISTER_TEVT_Pos) /**< (SDMMC_RTISTER) The TEVT status flag in SDMMC_RTISTR is enabled. Position  */
#define SDMMC_RTISTER_Msk                     _U_(0x01)                                            /**< (SDMMC_RTISTER) Register Mask  */


/* -------- SDMMC_RTISIER : (SDMMC Offset: 0x219) (R/W 8) Retuning Timer Interrupt Signal Enable Register -------- */
#define SDMMC_RTISIER_TEVT_Pos                _U_(0)                                               /**< (SDMMC_RTISIER) Retuning Timer Event Position */
#define SDMMC_RTISIER_TEVT_Msk                (_U_(0x1) << SDMMC_RTISIER_TEVT_Pos)                 /**< (SDMMC_RTISIER) Retuning Timer Event Mask */
#define SDMMC_RTISIER_TEVT(value)             (SDMMC_RTISIER_TEVT_Msk & ((value) << SDMMC_RTISIER_TEVT_Pos))
#define   SDMMC_RTISIER_TEVT_MASKED_Val       _U_(0x0)                                             /**< (SDMMC_RTISIER) No interrupt is generated when the TEVT status rises in SDMMC_RTISTR.  */
#define   SDMMC_RTISIER_TEVT_ENABLED_Val      _U_(0x1)                                             /**< (SDMMC_RTISIER) An interrupt is generated when the TEVT status rises in SDMMC_RTISTR.  */
#define SDMMC_RTISIER_TEVT_MASKED             (SDMMC_RTISIER_TEVT_MASKED_Val << SDMMC_RTISIER_TEVT_Pos) /**< (SDMMC_RTISIER) No interrupt is generated when the TEVT status rises in SDMMC_RTISTR. Position  */
#define SDMMC_RTISIER_TEVT_ENABLED            (SDMMC_RTISIER_TEVT_ENABLED_Val << SDMMC_RTISIER_TEVT_Pos) /**< (SDMMC_RTISIER) An interrupt is generated when the TEVT status rises in SDMMC_RTISTR. Position  */
#define SDMMC_RTISIER_Msk                     _U_(0x01)                                            /**< (SDMMC_RTISIER) Register Mask  */


/* -------- SDMMC_RTISTR : (SDMMC Offset: 0x21C) (R/W 8) Retuning Timer Interrupt Status Register -------- */
#define SDMMC_RTISTR_TEVT_Pos                 _U_(0)                                               /**< (SDMMC_RTISTR) Retuning Timer Event Position */
#define SDMMC_RTISTR_TEVT_Msk                 (_U_(0x1) << SDMMC_RTISTR_TEVT_Pos)                  /**< (SDMMC_RTISTR) Retuning Timer Event Mask */
#define SDMMC_RTISTR_TEVT(value)              (SDMMC_RTISTR_TEVT_Msk & ((value) << SDMMC_RTISTR_TEVT_Pos))
#define SDMMC_RTISTR_Msk                      _U_(0x01)                                            /**< (SDMMC_RTISTR) Register Mask  */


/* -------- SDMMC_RTSSR : (SDMMC Offset: 0x21D) ( R/ 8) Retuning Timer Status Slots Register -------- */
#define SDMMC_RTSSR_TEVTSLOT_Pos              _U_(0)                                               /**< (SDMMC_RTSSR) Retuning Timer Event Slots Position */
#define SDMMC_RTSSR_TEVTSLOT_Msk              (_U_(0x3) << SDMMC_RTSSR_TEVTSLOT_Pos)               /**< (SDMMC_RTSSR) Retuning Timer Event Slots Mask */
#define SDMMC_RTSSR_TEVTSLOT(value)           (SDMMC_RTSSR_TEVTSLOT_Msk & ((value) << SDMMC_RTSSR_TEVTSLOT_Pos))
#define SDMMC_RTSSR_Msk                       _U_(0x03)                                            /**< (SDMMC_RTSSR) Register Mask  */


/* -------- SDMMC_TUNCR : (SDMMC Offset: 0x220) (R/W 32) Tuning Control Register -------- */
#define SDMMC_TUNCR_SMPLPT_Pos                _U_(0)                                               /**< (SDMMC_TUNCR) Sampling Point Position */
#define SDMMC_TUNCR_SMPLPT_Msk                (_U_(0x1) << SDMMC_TUNCR_SMPLPT_Pos)                 /**< (SDMMC_TUNCR) Sampling Point Mask */
#define SDMMC_TUNCR_SMPLPT(value)             (SDMMC_TUNCR_SMPLPT_Msk & ((value) << SDMMC_TUNCR_SMPLPT_Pos))
#define SDMMC_TUNCR_Msk                       _U_(0x00000001)                                      /**< (SDMMC_TUNCR) Register Mask  */


